controllers/PostsController.php

    public function actionLike($id)
    {
        $this->layout ='auth';
        $posts = $this->findPost($id);
        $user_id = \Yii::$app->user->id;


         $likes = \app\models\Likes::find()
        ->andWhere([
            'posts_id' => $id,
            'Users_id' => $user_id
        ]) ->one();

        if(!$likes){

        $likes = new Likes();
        $likes->Posts_id = $id;
        $likes->Users_id = $user_id;
        // $likes->validate();
        // if ($likes->errors) return $this->asJson($likes->errors);
        $likes->save();
        }
        else if ($likes){
            $likes->delete();
---
INSERT INTO `Likes` (`Posts_id`, `Users_id`) VALUES ('8', 4)
DELETE FROM `Likes` WHERE `id`=67