models/User.php

SELECT * FROM `user` WHERE `name`='raghad'
---
    public static function findByUsername($name){
        return self::findOne(['name'=>$name]);